Wen-lyw/micropython/ports/esp32/boards/LYW_WATCH_S3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "LYW_WATCH_S3"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

#define MICROPY_HW_ENABLE_UART_REPL         (1)
#define MICROPY_HW_ESP_USB_SERIAL_JTAG      (0)
#define MICROPY_HW_ENABLE_USBDEV            (0)

/* 下面这些不是必须，但保留无妨 */
#define MICROPY_HW_USB_CDC                  (0)
#define MICROPY_HW_USB_MSC                  (0)
